```
$ cat a.tf
provider "kubernetes" {
  config_path = "~/.kube/config"
}


data "kubernetes_secret" "test" {
  metadata {
    name = "test"
  }

  binary_data = {
    "tls.crt" = ""
    "tls.key" = ""
  }
}

# I want to test that the data created by the data source is usable.
# But I'm unable to output the data, or write it a file,
# So I'll have to feed the data into a new resource instead.
#
# Didn't work
output "binary_data" {
  value = nonsensitive(data.kubernetes_secret.test.binary_data)
}
#

resource "kubernetes_secret" "test2" {
  metadata {
    name = "test2"
  }
  type        = "tls"
  binary_data = data.kubernetes_secret.test.binary_data
}
```

```
$ ta
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/azurerm in /Users/vlazarenko/go/bin
│  - hashicorp/kubernetes in /Users/vlazarenko/go/bin
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_secret.test2 will be created
  + resource "kubernetes_secret" "test2" {
      + binary_data = (sensitive value)
      + data        = (sensitive value)
      + id          = (known after apply)
      + type        = "tls"

      + metadata {
          + generation       = (known after apply)
          + name             = "test2"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + binary_data = {
      + "tls.crt" = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURGekNDQWYrZ0F3SUJBZ0lSQU13Y21sQlZvV2lPUDFBc2JFY1RLSjB3RFFZSktvWklodmNOQVFFTEJRQXcKRlRFVE1CRUdBMVVFQ2hNS2RteGhlbUZ5Wlc1cmJ6QWVGdzB5TVRBMU1qY3lNakF6TURCYUZ3MHlOREExTVRFeQpNakF6TURCYU1DRXhIekFkQmdOVkJBb01GblpzWVhwaGNtVnVhMjh1UEdKdmIzUnpkSEpoY0Q0d2dnRWlNQTBHCkNTcUdTSWIzRFFFQkFRVUFBNElCRHdBd2dnRUtBb0lCQVFETWxIWXFIQUhNay9TRTFMSHJvdHRLL1Z1d3plK2cKM25ZL3R1OHo2Szh1TDN2TEU3OGZaOUNzWjlCN2M4ZUdXZE4wcS9qdFdaOThtcmFVUFdteThKUE95Sjl2RWZheQpoUXdmY2E2ZjhlbTVSanV3WW1NeHF0M2VIaldMWU4yVzB4anJCS2g3ZUNTUlBUajJJTEY4dEo3VGpqSGc0eUZVCjhLcXY0a1BLeEJYMVFmZXVFSFI5OW5xVTl6ZWNqcUxWWTk5WC9ibmNhT3ZkajcrUCtxZUxSTjVrOUhhV05EYVYKWnp2OWVSK3QyWkJBYUJqVERGOVpQd2FYK01vazU4eHRZUHF6QmF6a1F0aWJFLzdxQitYRTVRWnRSTklaeEZxaApWT1dMYVFadnBaR0k4TTVDQS92QVpMODlCU0VGbFZUY2ZSMGRzQUwwb0E2eUNUbTVRWlBseC9vNUFnTUJBQUdqClZqQlVNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0RBakFNQmdOVkhSTUIKQWY4RUFqQUFNQjhHQTFVZEl3UVlNQmFBRkdMd01GZWdpcmxza3RBNU8vVExsazh1NDdkQk1BMEdDU3FHU0liMwpEUUVCQ3dVQUE0SUJBUUJuWEVjK1ZqZ0Jaa25mclBEUXVBZDg5c2RVWUFNdG9UV3FJNVprZkR1Z3VXclJXSUFQCkxLSXBFQ2JZN29DRFdRMDk1STFoZE9EYTl5eHBDZ3lWbGNHc25PNDhpeTdKS29wUDZ0dEhOOEhtN3kvczNSZ2oKYlM5WW1yS2tYOEJiNlZTZ2JuWXB1eGVWU3h4WUVHTlpsZFJ4dzZEOTIreXBMQyswZXpsemMxUVJJMkhEL3hFQwpVME1BMWFLM0QxQTlaWjVOaWdTRXA5TktETkZidm9OVWIxTWl4cVNaRjRPU05NakYvTUhrUmJ2bElpNnBMb3ZiCnZ0YkhNVlBUMTNrOGxjWnFkTlpoY2NGbzdBd1ZITVlkUlJaa3V2cXIyVGtJeG1yVkUrTTJKRW5hTW1YeCtYenYKMTlubmxIK093NThZb0Q1UCtnTkJBbzNud0JXT0drN1JzTTBQCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
      + "tls.key" = "LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlFcEFJQkFBS0NBUUVBekpSMktod0J6SlAwaE5TeDY2TGJTdjFic00zdm9ONTJQN2J2TStpdkxpOTd5eE8vCkgyZlFyR2ZRZTNQSGhsblRkS3Y0N1ZtZmZKcTJsRDFwc3ZDVHpzaWZieEgyc29VTUgzR3VuL0hwdVVZN3NHSmoKTWFyZDNoNDFpMkRkbHRNWTZ3U29lM2dra1QwNDlpQ3hmTFNlMDQ0eDRPTWhWUENxcitKRHlzUVY5VUgzcmhCMApmZlo2bFBjM25JNmkxV1BmVi8yNTNHanIzWSsvai9xbmkwVGVaUFIybGpRMmxXYzcvWGtmcmRtUVFHZ1kwd3hmCldUOEdsL2pLSk9mTWJXRDZzd1dzNUVMWW14UCs2Z2ZseE9VR2JVVFNHY1Jhb1ZUbGkya0diNldSaVBET1FnUDcKd0dTL1BRVWhCWlZVM0gwZEhiQUM5S0FPc2drNXVVR1Q1Y2Y2T1FJREFRQUJBb0lCQVFDUWhUeG9pUHA0WS9qegpzVEd6VFl2dkVNWXFRNERKdXYzOENxWTJuR1RNa3J5My9FNGl5SHJ3b0RIMlZCY2FnUEJSVm45MlpMNjNEckIyClRtQVNDY1BRNjRjOXRvbjVHT1kwZkdHcEdnTkxZQ01nZXBDcWNKTmxxeCtXUTZxbU5xQSt2ajZyWW5jcXB2NUwKV1ZNb3pvdjQxVlhGRVk3bGExS1pCNVZ1YzFFenZNOGVIcVdyNVQyRm4yeE5Tb0Fya3RyUTVCQ05sd2dXeFY4eApqVHVyNmd0NVpUQW5VL3YxQWVpUGRMcllxdDBYdWE4THlraWtkeEtkR21DYWZJdmhvT2pPTW4wUkRwamYwSmtJCjFhRmRpTFhqQTZDZitjRDBHUkVjUGxEdG9ZTXdnSXBKRkdEY2tsemhTQWpqS0o0OWk1LzdvT0pLRGJPOG9mbVoKQXl5Yml1SUJBb0dCQU5TY1Z1M2lKQmN5Q2NoUmt0aWdTMnpURHNzYVg1TjhGKytrY090YUlUZ01OTkJsZlhRWApDN0ZZOGFZZ2RBQWh3QWVJN2JldkZiQVNrTWN0MEJZMHl5S291K0ZRWHdBcGJMTitqbDVZQ2U0NXpPdTlBQWxPCmo4OG5EVW9qTEpRNFIzWW9tVGFXMW42WUkwY1lkMHd6cHBUbkdWMjZtK2FEclVhZ1owVWMvN0o1QW9HQkFQWlUKajY5a01nVFdoeURINkUvM1NyM2RxUjFSZ2ZPSGE0bHZqWWhjN0d5alllTStqYk9XQjdwQlhlV081Q3h5YktTaAp4WlZHWUoyNVJmQzVYYVduVk9XNE9SeDR0QWc2VGxOVjhHbVpIUmtaTFo1SytJV3dTOFkyV3g3dDBrck0xQW5vCms2T2UzUFVIcUF6aE1XRWdGcHJ0NHhvOHIrSDgwUG1aa0llT3NwWEJBb0dCQUx0ZVBFM1FhYlgzWngrZXBDYzgKdkx2ZkZMNXhNNkdxVHYzbWtZMFlGUVpyMjI5OHdaNjVZSmllcGZlZHloMERvVlFDbkZ5d2RCQ0RqQXU4bUJHNQozUHRpY0pFVVgyU3BIUjdpZlYwdmdURHN4MmRKWE9yV3pXM21JSlFoZzN2c1RTNFlnVTNXaUpsd1FrYTVqUWtlCnk4T1dGb2kvbC8wQ05vWnpmZzh1aXpraEFvR0FUd3BoTkpFODc0cDZ2NDBGd1NzRGc1cnRtZWUrZ0FzUytYMmUKOTRPQnBYWmpnWXhmNGFFaGg2VlQ0TVlSOXlVY01WTnJWL1BHS3JYNWVEMnlpK1grZXR1N0Q2UzNkL0JsazUzKwp6NU4rMzcvUmdIcGo5bG5VWnB5b2JtczNVQ01iWXJhTE1UUlhpQlJWMnhRalNSd0h4TnpTUTJmM3M5YndvemFnClJxOEdKTUVDZ1lBQ2JwejhMQk9ZNkEzTnhBRGJFT0ZPUGdISFJrM2cxWjhXcWxtMCtpL0I1RFZHMlFKQUtjV1oKZEZxU1hkbzg0U0ZwZTVXdkVoekxWRlVpVnV4WWtIOHBpejhkTkhOUkM0YkVFTFh4ZUM4Q0cydUpvVk5CMnN3QgpzYzkyeWtBa3MxN09WR1FGSDJCNjNyWSs5cW5CTVdoeXZLRHZidkZDeXZDV2hmYjZITjZBNUE9PQotLS0tLUVORCBSU0EgUFJJVkFURSBLRVktLS0tLQo="
    }

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

kubernetes_secret.test2: Creating...
kubernetes_secret.test2: Creation complete after 0s [id=default/test2]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

binary_data = tomap({
  "tls.crt" = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURGekNDQWYrZ0F3SUJBZ0lSQU13Y21sQlZvV2lPUDFBc2JFY1RLSjB3RFFZSktvWklodmNOQVFFTEJRQXcKRlRFVE1CRUdBMVVFQ2hNS2RteGhlbUZ5Wlc1cmJ6QWVGdzB5TVRBMU1qY3lNakF6TURCYUZ3MHlOREExTVRFeQpNakF6TURCYU1DRXhIekFkQmdOVkJBb01GblpzWVhwaGNtVnVhMjh1UEdKdmIzUnpkSEpoY0Q0d2dnRWlNQTBHCkNTcUdTSWIzRFFFQkFRVUFBNElCRHdBd2dnRUtBb0lCQVFETWxIWXFIQUhNay9TRTFMSHJvdHRLL1Z1d3plK2cKM25ZL3R1OHo2Szh1TDN2TEU3OGZaOUNzWjlCN2M4ZUdXZE4wcS9qdFdaOThtcmFVUFdteThKUE95Sjl2RWZheQpoUXdmY2E2ZjhlbTVSanV3WW1NeHF0M2VIaldMWU4yVzB4anJCS2g3ZUNTUlBUajJJTEY4dEo3VGpqSGc0eUZVCjhLcXY0a1BLeEJYMVFmZXVFSFI5OW5xVTl6ZWNqcUxWWTk5WC9ibmNhT3ZkajcrUCtxZUxSTjVrOUhhV05EYVYKWnp2OWVSK3QyWkJBYUJqVERGOVpQd2FYK01vazU4eHRZUHF6QmF6a1F0aWJFLzdxQitYRTVRWnRSTklaeEZxaApWT1dMYVFadnBaR0k4TTVDQS92QVpMODlCU0VGbFZUY2ZSMGRzQUwwb0E2eUNUbTVRWlBseC9vNUFnTUJBQUdqClZqQlVNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0RBakFNQmdOVkhSTUIKQWY4RUFqQUFNQjhHQTFVZEl3UVlNQmFBRkdMd01GZWdpcmxza3RBNU8vVExsazh1NDdkQk1BMEdDU3FHU0liMwpEUUVCQ3dVQUE0SUJBUUJuWEVjK1ZqZ0Jaa25mclBEUXVBZDg5c2RVWUFNdG9UV3FJNVprZkR1Z3VXclJXSUFQCkxLSXBFQ2JZN29DRFdRMDk1STFoZE9EYTl5eHBDZ3lWbGNHc25PNDhpeTdKS29wUDZ0dEhOOEhtN3kvczNSZ2oKYlM5WW1yS2tYOEJiNlZTZ2JuWXB1eGVWU3h4WUVHTlpsZFJ4dzZEOTIreXBMQyswZXpsemMxUVJJMkhEL3hFQwpVME1BMWFLM0QxQTlaWjVOaWdTRXA5TktETkZidm9OVWIxTWl4cVNaRjRPU05NakYvTUhrUmJ2bElpNnBMb3ZiCnZ0YkhNVlBUMTNrOGxjWnFkTlpoY2NGbzdBd1ZITVlkUlJaa3V2cXIyVGtJeG1yVkUrTTJKRW5hTW1YeCtYenYKMTlubmxIK093NThZb0Q1UCtnTkJBbzNud0JXT0drN1JzTTBQCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
  "tls.key" = "LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlFcEFJQkFBS0NBUUVBekpSMktod0J6SlAwaE5TeDY2TGJTdjFic00zdm9ONTJQN2J2TStpdkxpOTd5eE8vCkgyZlFyR2ZRZTNQSGhsblRkS3Y0N1ZtZmZKcTJsRDFwc3ZDVHpzaWZieEgyc29VTUgzR3VuL0hwdVVZN3NHSmoKTWFyZDNoNDFpMkRkbHRNWTZ3U29lM2dra1QwNDlpQ3hmTFNlMDQ0eDRPTWhWUENxcitKRHlzUVY5VUgzcmhCMApmZlo2bFBjM25JNmkxV1BmVi8yNTNHanIzWSsvai9xbmkwVGVaUFIybGpRMmxXYzcvWGtmcmRtUVFHZ1kwd3hmCldUOEdsL2pLSk9mTWJXRDZzd1dzNUVMWW14UCs2Z2ZseE9VR2JVVFNHY1Jhb1ZUbGkya0diNldSaVBET1FnUDcKd0dTL1BRVWhCWlZVM0gwZEhiQUM5S0FPc2drNXVVR1Q1Y2Y2T1FJREFRQUJBb0lCQVFDUWhUeG9pUHA0WS9qegpzVEd6VFl2dkVNWXFRNERKdXYzOENxWTJuR1RNa3J5My9FNGl5SHJ3b0RIMlZCY2FnUEJSVm45MlpMNjNEckIyClRtQVNDY1BRNjRjOXRvbjVHT1kwZkdHcEdnTkxZQ01nZXBDcWNKTmxxeCtXUTZxbU5xQSt2ajZyWW5jcXB2NUwKV1ZNb3pvdjQxVlhGRVk3bGExS1pCNVZ1YzFFenZNOGVIcVdyNVQyRm4yeE5Tb0Fya3RyUTVCQ05sd2dXeFY4eApqVHVyNmd0NVpUQW5VL3YxQWVpUGRMcllxdDBYdWE4THlraWtkeEtkR21DYWZJdmhvT2pPTW4wUkRwamYwSmtJCjFhRmRpTFhqQTZDZitjRDBHUkVjUGxEdG9ZTXdnSXBKRkdEY2tsemhTQWpqS0o0OWk1LzdvT0pLRGJPOG9mbVoKQXl5Yml1SUJBb0dCQU5TY1Z1M2lKQmN5Q2NoUmt0aWdTMnpURHNzYVg1TjhGKytrY090YUlUZ01OTkJsZlhRWApDN0ZZOGFZZ2RBQWh3QWVJN2JldkZiQVNrTWN0MEJZMHl5S291K0ZRWHdBcGJMTitqbDVZQ2U0NXpPdTlBQWxPCmo4OG5EVW9qTEpRNFIzWW9tVGFXMW42WUkwY1lkMHd6cHBUbkdWMjZtK2FEclVhZ1owVWMvN0o1QW9HQkFQWlUKajY5a01nVFdoeURINkUvM1NyM2RxUjFSZ2ZPSGE0bHZqWWhjN0d5alllTStqYk9XQjdwQlhlV081Q3h5YktTaAp4WlZHWUoyNVJmQzVYYVduVk9XNE9SeDR0QWc2VGxOVjhHbVpIUmtaTFo1SytJV3dTOFkyV3g3dDBrck0xQW5vCms2T2UzUFVIcUF6aE1XRWdGcHJ0NHhvOHIrSDgwUG1aa0llT3NwWEJBb0dCQUx0ZVBFM1FhYlgzWngrZXBDYzgKdkx2ZkZMNXhNNkdxVHYzbWtZMFlGUVpyMjI5OHdaNjVZSmllcGZlZHloMERvVlFDbkZ5d2RCQ0RqQXU4bUJHNQozUHRpY0pFVVgyU3BIUjdpZlYwdmdURHN4MmRKWE9yV3pXM21JSlFoZzN2c1RTNFlnVTNXaUpsd1FrYTVqUWtlCnk4T1dGb2kvbC8wQ05vWnpmZzh1aXpraEFvR0FUd3BoTkpFODc0cDZ2NDBGd1NzRGc1cnRtZWUrZ0FzUytYMmUKOTRPQnBYWmpnWXhmNGFFaGg2VlQ0TVlSOXlVY01WTnJWL1BHS3JYNWVEMnlpK1grZXR1N0Q2UzNkL0JsazUzKwp6NU4rMzcvUmdIcGo5bG5VWnB5b2JtczNVQ01iWXJhTE1UUlhpQlJWMnhRalNSd0h4TnpTUTJmM3M5YndvemFnClJxOEdKTUVDZ1lBQ2JwejhMQk9ZNkEzTnhBRGJFT0ZPUGdISFJrM2cxWjhXcWxtMCtpL0I1RFZHMlFKQUtjV1oKZEZxU1hkbzg0U0ZwZTVXdkVoekxWRlVpVnV4WWtIOHBpejhkTkhOUkM0YkVFTFh4ZUM4Q0cydUpvVk5CMnN3QgpzYzkyeWtBa3MxN09WR1FGSDJCNjNyWSs5cW5CTVdoeXZLRHZidkZDeXZDV2hmYjZITjZBNUE9PQotLS0tLUVORCBSU0EgUFJJVkFURSBLRVktLS0tLQo="
})
```

```
[0:12](⎈ |minikube:default)➜  ~/ktest $ kubectl get secret test2 -o json |jq .data
{
  "tls.crt": "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURGekNDQWYrZ0F3SUJBZ0lSQU13Y21sQlZvV2lPUDFBc2JFY1RLSjB3RFFZSktvWklodmNOQVFFTEJRQXcKRlRFVE1CRUdBMVVFQ2hNS2RteGhlbUZ5Wlc1cmJ6QWVGdzB5TVRBMU1qY3lNakF6TURCYUZ3MHlOREExTVRFeQpNakF6TURCYU1DRXhIekFkQmdOVkJBb01GblpzWVhwaGNtVnVhMjh1UEdKdmIzUnpkSEpoY0Q0d2dnRWlNQTBHCkNTcUdTSWIzRFFFQkFRVUFBNElCRHdBd2dnRUtBb0lCQVFETWxIWXFIQUhNay9TRTFMSHJvdHRLL1Z1d3plK2cKM25ZL3R1OHo2Szh1TDN2TEU3OGZaOUNzWjlCN2M4ZUdXZE4wcS9qdFdaOThtcmFVUFdteThKUE95Sjl2RWZheQpoUXdmY2E2ZjhlbTVSanV3WW1NeHF0M2VIaldMWU4yVzB4anJCS2g3ZUNTUlBUajJJTEY4dEo3VGpqSGc0eUZVCjhLcXY0a1BLeEJYMVFmZXVFSFI5OW5xVTl6ZWNqcUxWWTk5WC9ibmNhT3ZkajcrUCtxZUxSTjVrOUhhV05EYVYKWnp2OWVSK3QyWkJBYUJqVERGOVpQd2FYK01vazU4eHRZUHF6QmF6a1F0aWJFLzdxQitYRTVRWnRSTklaeEZxaApWT1dMYVFadnBaR0k4TTVDQS92QVpMODlCU0VGbFZUY2ZSMGRzQUwwb0E2eUNUbTVRWlBseC9vNUFnTUJBQUdqClZqQlVNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0RBakFNQmdOVkhSTUIKQWY4RUFqQUFNQjhHQTFVZEl3UVlNQmFBRkdMd01GZWdpcmxza3RBNU8vVExsazh1NDdkQk1BMEdDU3FHU0liMwpEUUVCQ3dVQUE0SUJBUUJuWEVjK1ZqZ0Jaa25mclBEUXVBZDg5c2RVWUFNdG9UV3FJNVprZkR1Z3VXclJXSUFQCkxLSXBFQ2JZN29DRFdRMDk1STFoZE9EYTl5eHBDZ3lWbGNHc25PNDhpeTdKS29wUDZ0dEhOOEhtN3kvczNSZ2oKYlM5WW1yS2tYOEJiNlZTZ2JuWXB1eGVWU3h4WUVHTlpsZFJ4dzZEOTIreXBMQyswZXpsemMxUVJJMkhEL3hFQwpVME1BMWFLM0QxQTlaWjVOaWdTRXA5TktETkZidm9OVWIxTWl4cVNaRjRPU05NakYvTUhrUmJ2bElpNnBMb3ZiCnZ0YkhNVlBUMTNrOGxjWnFkTlpoY2NGbzdBd1ZITVlkUlJaa3V2cXIyVGtJeG1yVkUrTTJKRW5hTW1YeCtYenYKMTlubmxIK093NThZb0Q1UCtnTkJBbzNud0JXT0drN1JzTTBQCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K",
  "tls.key": "LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlFcEFJQkFBS0NBUUVBekpSMktod0J6SlAwaE5TeDY2TGJTdjFic00zdm9ONTJQN2J2TStpdkxpOTd5eE8vCkgyZlFyR2ZRZTNQSGhsblRkS3Y0N1ZtZmZKcTJsRDFwc3ZDVHpzaWZieEgyc29VTUgzR3VuL0hwdVVZN3NHSmoKTWFyZDNoNDFpMkRkbHRNWTZ3U29lM2dra1QwNDlpQ3hmTFNlMDQ0eDRPTWhWUENxcitKRHlzUVY5VUgzcmhCMApmZlo2bFBjM25JNmkxV1BmVi8yNTNHanIzWSsvai9xbmkwVGVaUFIybGpRMmxXYzcvWGtmcmRtUVFHZ1kwd3hmCldUOEdsL2pLSk9mTWJXRDZzd1dzNUVMWW14UCs2Z2ZseE9VR2JVVFNHY1Jhb1ZUbGkya0diNldSaVBET1FnUDcKd0dTL1BRVWhCWlZVM0gwZEhiQUM5S0FPc2drNXVVR1Q1Y2Y2T1FJREFRQUJBb0lCQVFDUWhUeG9pUHA0WS9qegpzVEd6VFl2dkVNWXFRNERKdXYzOENxWTJuR1RNa3J5My9FNGl5SHJ3b0RIMlZCY2FnUEJSVm45MlpMNjNEckIyClRtQVNDY1BRNjRjOXRvbjVHT1kwZkdHcEdnTkxZQ01nZXBDcWNKTmxxeCtXUTZxbU5xQSt2ajZyWW5jcXB2NUwKV1ZNb3pvdjQxVlhGRVk3bGExS1pCNVZ1YzFFenZNOGVIcVdyNVQyRm4yeE5Tb0Fya3RyUTVCQ05sd2dXeFY4eApqVHVyNmd0NVpUQW5VL3YxQWVpUGRMcllxdDBYdWE4THlraWtkeEtkR21DYWZJdmhvT2pPTW4wUkRwamYwSmtJCjFhRmRpTFhqQTZDZitjRDBHUkVjUGxEdG9ZTXdnSXBKRkdEY2tsemhTQWpqS0o0OWk1LzdvT0pLRGJPOG9mbVoKQXl5Yml1SUJBb0dCQU5TY1Z1M2lKQmN5Q2NoUmt0aWdTMnpURHNzYVg1TjhGKytrY090YUlUZ01OTkJsZlhRWApDN0ZZOGFZZ2RBQWh3QWVJN2JldkZiQVNrTWN0MEJZMHl5S291K0ZRWHdBcGJMTitqbDVZQ2U0NXpPdTlBQWxPCmo4OG5EVW9qTEpRNFIzWW9tVGFXMW42WUkwY1lkMHd6cHBUbkdWMjZtK2FEclVhZ1owVWMvN0o1QW9HQkFQWlUKajY5a01nVFdoeURINkUvM1NyM2RxUjFSZ2ZPSGE0bHZqWWhjN0d5alllTStqYk9XQjdwQlhlV081Q3h5YktTaAp4WlZHWUoyNVJmQzVYYVduVk9XNE9SeDR0QWc2VGxOVjhHbVpIUmtaTFo1SytJV3dTOFkyV3g3dDBrck0xQW5vCms2T2UzUFVIcUF6aE1XRWdGcHJ0NHhvOHIrSDgwUG1aa0llT3NwWEJBb0dCQUx0ZVBFM1FhYlgzWngrZXBDYzgKdkx2ZkZMNXhNNkdxVHYzbWtZMFlGUVpyMjI5OHdaNjVZSmllcGZlZHloMERvVlFDbkZ5d2RCQ0RqQXU4bUJHNQozUHRpY0pFVVgyU3BIUjdpZlYwdmdURHN4MmRKWE9yV3pXM21JSlFoZzN2c1RTNFlnVTNXaUpsd1FrYTVqUWtlCnk4T1dGb2kvbC8wQ05vWnpmZzh1aXpraEFvR0FUd3BoTkpFODc0cDZ2NDBGd1NzRGc1cnRtZWUrZ0FzUytYMmUKOTRPQnBYWmpnWXhmNGFFaGg2VlQ0TVlSOXlVY01WTnJWL1BHS3JYNWVEMnlpK1grZXR1N0Q2UzNkL0JsazUzKwp6NU4rMzcvUmdIcGo5bG5VWnB5b2JtczNVQ01iWXJhTE1UUlhpQlJWMnhRalNSd0h4TnpTUTJmM3M5YndvemFnClJxOEdKTUVDZ1lBQ2JwejhMQk9ZNkEzTnhBRGJFT0ZPUGdISFJrM2cxWjhXcWxtMCtpL0I1RFZHMlFKQUtjV1oKZEZxU1hkbzg0U0ZwZTVXdkVoekxWRlVpVnV4WWtIOHBpejhkTkhOUkM0YkVFTFh4ZUM4Q0cydUpvVk5CMnN3QgpzYzkyeWtBa3MxN09WR1FGSDJCNjNyWSs5cW5CTVdoeXZLRHZidkZDeXZDV2hmYjZITjZBNUE9PQotLS0tLUVORCBSU0EgUFJJVkFURSBLRVktLS0tLQo="
}
```